embedlinux/Code_learning/SDK_2.5.0_MIMXRT685S/boards/evkmimxrt685/usb_examples/usb_suspend_resume_device_hid_mouse_lite/bm/usb_lpc_io_drv.c
/*
 * Copyright (c) 2016, Freescale Semiconductor, Inc.
 * Copyright 2016 - 2017 NXP
 * All rights reserved.
 *
 * SPDX-License-Identifier: BSD-3-Clause
 */

#include "fsl_device_registers.h"
#include "usb_io.h"
#include "fsl_gpio.h"

#ifdef SYSCON_STARTERP_GINT0_MASK
#define STARTER STARTERP
#define SYSCON_STARTER_GINT0_MASK SYSCON_STARTERP_GINT0_MASK
#endif
#ifdef SYSCON_STARTERP_GINT1_MASK
#define SYSCON_STARTER_GINT1_MASK SYSCON_STARTERP_GINT1_MASK
#endif

void USB_GpioInit(uint8_t instance, uint8_t port, uint32_t pinMask, usb_gpio_callback_t callback)
{
}

void USB_GpioInt(uint8_t instance, uint8_t enable)
{
}

void USB_GpioInterruptInit(uint8_t instance, uint8_t port, uint32_t pin, uint8_t trrigger, usb_gpio_callback_t callback)
{
}

void USB_GpioInterruptEnable(uint8_t instance, uint8_t port, uint32_t pin, uint8_t enable)
{
}

void USB_GpioOutputInit(uint8_t instance, uint32_t port, uint32_t pin, uint8_t defaultValue)
{
    GPIO_Type *instanceList[] = GPIO_BASE_PTRS;
    gpio_pin_config_t pin_config = {
        kGPIO_DigitalOutput, defaultValue,
    };

    GPIO_PinInit(instanceList[instance], port, pin, &pin_config);
}

void USB_GpioOutputWritePin(uint8_t instance, uint32_t port, uint32_t pin, uint8_t output)
{
    GPIO_Type *instanceList[] = GPIO_BASE_PTRS;

    GPIO_PinWrite(instanceList[instance], port, pin, output);
}

void USB_GpioInputInit(uint8_t instance, uint32_t port, uint32_t pin)
{
    GPIO_Type *instanceList[] = GPIO_BASE_PTRS;
    gpio_pin_config_t pin_config = {
        kGPIO_DigitalInput, 0,
    };

    GPIO_PinInit(instanceList[0], port, pin, &pin_config);
}

uint8_t USB_GpioInputReadPin(uint8_t instance, uint32_t port, uint32_t pin)
{
    GPIO_Type *instanceList[] = GPIO_BASE_PTRS;
    return GPIO_PinRead(instanceList[0], port, pin);
}
